# 1) Create a pandas dataframe (DataFrame name as 'df') with numpy random values 4 features and 4 observation

In [109]:
import pandas as pd
import numpy as np
import random
df1=pd.DataFrame(np.random.rand(4,4))
df2=pd.DataFrame(np.random.randn(4,4))
df3=pd.DataFrame((np.random.randint(4,40,4),np.random.randint(4,40,4),np.random.randint(4,40,4),np.random.randint(4,40,4)))
df1

          0         1         2         3
0  0.822155  0.688564  0.121277  0.143302
1  0.417516  0.661531  0.246785  0.637578
2  0.261761  0.359232  0.417557  0.800540
3  0.157569  0.239905  0.193834  0.013935

In [110]:
df2

          0         1         2         3
0  1.798055 -0.162718  0.031957 -0.662750
1 -0.423195 -0.725037 -0.779588  0.913213
2  0.170650  2.058156 -0.573268  0.588166
3 -0.133362  1.930211 -0.817705 -1.823792

In [111]:
df3

    0   1   2   3
0  22  20  24  11
1  14  21  21  33
2   9  21  38  25
3  30  17   6  13

# 2) Rename the task - 1 'df' dataframe column names to 'Random value 1', 'Random value 2', 'Random value 3' & 'Random value 4

In [112]:
df1.columns=['Random value 1','Random value 2','Random value 3','Random value 4']
df2.columns=['Random value 1','Random value 2','Random value 3','Random value 4']
df3.columns=['Random value 1','Random value 2','Random value 3','Random value 4']
df1

   Random value 1  Random value 2  Random value 3  Random value 4
0        0.822155        0.688564        0.121277        0.143302
1        0.417516        0.661531        0.246785        0.637578
2        0.261761        0.359232        0.417557        0.800540
3        0.157569        0.239905        0.193834        0.013935

In [113]:
df2

   Random value 1  Random value 2  Random value 3  Random value 4
0        1.798055       -0.162718        0.031957       -0.662750
1       -0.423195       -0.725037       -0.779588        0.913213
2        0.170650        2.058156       -0.573268        0.588166
3       -0.133362        1.930211       -0.817705       -1.823792

In [114]:
df3

   Random value 1  Random value 2  Random value 3  Random value 4
0              22              20              24              11
1              14              21              21              33
2               9              21              38              25
3              30              17               6              13

# 3) Find the descriptive statistics of the 'df' dataframe

In [115]:
df1.describe()

       Random value 1  Random value 2  Random value 3  Random value 4
count        4.000000        4.000000        4.000000        4.000000
mean         0.414750        0.487308        0.244863        0.398839
std          0.291853        0.222463        0.126101        0.379390
min          0.157569        0.239905        0.121277        0.013935
25%          0.235713        0.329400        0.175694        0.110960
50%          0.339638        0.510382        0.220309        0.390440
75%          0.518676        0.668289        0.289478        0.678318
max          0.822155        0.688564        0.417557        0.800540

In [116]:
df2.describe()

       Random value 1  Random value 2  Random value 3  Random value 4
count        4.000000        4.000000        4.000000        4.000000
mean         0.353037        0.775153       -0.534651       -0.246291
std          0.993388        1.427168        0.392704        1.252027
min         -0.423195       -0.725037       -0.817705       -1.823792
25%         -0.205820       -0.303298       -0.789117       -0.953011
50%          0.018644        0.883746       -0.676428       -0.037292
75%          0.577501        1.962197       -0.421961        0.669428
max          1.798055        2.058156        0.031957        0.913213

In [117]:
df3.describe()

       Random value 1  Random value 2  Random value 3  Random value 4
count        4.000000        4.000000        4.000000        4.000000
mean        18.750000       19.750000       22.250000       20.500000
std          9.215024        1.892969       13.124405       10.376255
min          9.000000       17.000000        6.000000       11.000000
25%         12.750000       19.250000       17.250000       12.500000
50%         18.000000       20.500000       22.500000       19.000000
75%         24.000000       21.000000       27.500000       27.000000
max         30.000000       21.000000       38.000000       33.000000

# 4) Check for the null values in 'df' and find the data type of the columns

In [118]:
print(df1.info())
df1.isnull().any()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Random value 1  4 non-null      float64
 1   Random value 2  4 non-null      float64
 2   Random value 3  4 non-null      float64
 3   Random value 4  4 non-null      float64
dtypes: float64(4)
memory usage: 260.0 bytes
None

Random value 1    False
Random value 2    False
Random value 3    False
Random value 4    False
dtype: bool

In [119]:
print(df2.info())
df2.isnull().any()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Random value 1  4 non-null      float64
 1   Random value 2  4 non-null      float64
 2   Random value 3  4 non-null      float64
 3   Random value 4  4 non-null      float64
dtypes: float64(4)
memory usage: 260.0 bytes
None

Random value 1    False
Random value 2    False
Random value 3    False
Random value 4    False
dtype: bool

In [120]:
print(df3.info())
df3.isnull().any()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Random value 1  4 non-null      int32
 1   Random value 2  4 non-null      int32
 2   Random value 3  4 non-null      int32
 3   Random value 4  4 non-null      int32
dtypes: int32(4)
memory usage: 196.0 bytes
None

Random value 1    False
Random value 2    False
Random value 3    False
Random value 4    False
dtype: bool

# 5) Display the 'Random value 2' & 'Random value 3' columns with location method and index location method

In [133]:
print(df1.loc[0:3,'Random value 2':'Random value 3'])
df1.iloc[0:4,1:3]

   Random value 2  Random value 3
0        0.688564        0.121277
1        0.661531        0.246785
2        0.359232        0.417557
3        0.239905        0.193834

   Random value 2  Random value 3
0        0.688564        0.121277
1        0.661531        0.246785
2        0.359232        0.417557
3        0.239905        0.193834

In [134]:
print(df2.loc[0:3,'Random value 2':'Random value 3'])
df2.iloc[0:4,1:3]

   Random value 2  Random value 3
0       -0.162718        0.031957
1       -0.725037       -0.779588
2        2.058156       -0.573268
3        1.930211       -0.817705

   Random value 2  Random value 3
0       -0.162718        0.031957
1       -0.725037       -0.779588
2        2.058156       -0.573268
3        1.930211       -0.817705

In [135]:
print(df3.loc[0:3,'Random value 2':'Random value 3'])
df3.iloc[0:4,1:3]

   Random value 2  Random value 3
0              20              24
1              21              21
2              21              38
3              17               6

   Random value 2  Random value 3
0              20              24
1              21              21
2              21              38
3              17               6